Constructs a preview control.
  Namespace:   Autodesk.Revit.UI
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public PreviewControl(
	Document document,
	ElementId viewId
)
  Visual Basic
Public Sub New ( _
	document As Document, _
	viewId As ElementId _
)
  Visual C++
public:
PreviewControl(
	Document^ document,
	ElementId^ viewId
)
 Parameters
  document
 Type:  Autodesk.Revit.DB Document
 The document.
  viewId
 Type:  Autodesk.Revit.DB ElementId
 The view id want to browse in this control.
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentNullException   |   Thrown when dbDocument or viewId is    a null reference (  Nothing  in Visual Basic)  .
   Autodesk.Revit.Exceptions ArgumentException   |   Thrown when the given document is a linked document or the given viewId is invalid or the view is a schedule or other non-graphical view such as schedule views or the project browser view.
   Autodesk.Revit.Exceptions InvalidOperationException   |   Thrown when there is an active preview control already.
 See Also
  PreviewControl Class
  Autodesk.Revit.UI Namespace